SOAP/app/src/main/assets/receive_image.xml

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
  <soap:Header>
    <AuthenticationHeader xmlns="http://tempuri.org/">
      <UserName>yardnorthtest</UserName>
      <Password>yardnorthtest</Password>
    </AuthenticationHeader>
  </soap:Header>
   <soap:Body>
    <ReceiveImage xmlns="http://tempuri.org/">
      <oImage>
        <Registration>string</Registration>
        <ImageDescription>string</ImageDescription>
        <FileName>string</FileName>
      </oImage>
    </ReceiveImage>
  </soap:Body>
</soap:Envelope>